slatt/init.org
#+TITLE: Emacs Config
:PROPERTIES:
#+AUTHOR: VAMP
#+STARTUP: fold
#+PROPERTY: header-args :results silent :tangle yes :padline no
:END:

* Early-init.el
#+BEGIN_SRC emacs-lisp :tangle ./early-init.el
  ;;; early-init.el --- Early Init File -*- lexical-binding: t -*-

  ;; Author: VAMP
  ;; URL:
  ;; Package-Requires: ((emacs "28.1"))
  ;;; Commentary:
  ;;; Code:


  ;; Stop asking if sustom themes are safe
  (setq custom-safe-themes t)
  (load-theme 'modus-vivendi)

  (setq frame-resize-pixelwise t)

  ;; Do not resize the frame at this early stage.
  (setq frame-inhibit-implied-resize t)


  ;; Initialise installed packages
  (setq package-enable-at-startup t)

  (defvar package-quickstart)

  ;; Allow loading from the package cache
  (setq package-quickstart t)

  ;; Disable GUI elements
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (setq inhibit-splash-screen t)
  (setq use-dialog-box t)                 ; only for mouse events
  (setq use-file-dialog nil)

  (setq inhibit-startup-echo-area-message user-login-name) ; read the docstring
  (setq inhibit-startup-screen t)
  (setq inhibit-startup-buffer-menu t)

  (setq native-comp-async-report-warnings-errors 'silent) ; emacs28 with native compilation

  ;; Garbage Collections
  (setq gc-cons-percentage 0.6)

  ;; Compile warnings
  ;;  (setq warning-minimum-level :emergency)
  (setq native-comp-async-report-warnings-errors 'silent) ;; native-comp warning
  (setq byte-compile-warnings '(not free-vars unresolved noruntime lexical make-local))


  ;; MISC OPTIMIZATIONS ----
  ;;; optimizations (froom Doom's core.el). See that file for descriptions.
  (setq idle-update-delay 1.0)
  ;;; early-init.el ends here
#+END_SRC

* Init.el
** =Begin= Init.el
#+BEGIN_SRC emacs-lisp
;;; init.el --- Personal configuration file -*- lexical-binding: t -*-
;;; Commentary:
;;; Code:

#+END_SRC

** Packages
#+BEGIN_SRC emacs-lisp
(dolist (path '("vamp-modules"))
  (add-to-list 'load-path (locate-user-emacs-file path)))
(require 'package)

(setq package-archives
      '(("elpa" . "https://elpa.gnu.org/packages/")
        ("elpa-devel" . "https://elpa.gnu.org/devel/")
        ("nongnu" . "https://elpa.nongnu.org/nongnu/")
        ("melpa" . "https://melpa.org/packages/")))
;; Highest number gets priority (what is not mentioned has priority 0)
(setq package-archive-priorities
      '(("elpa" . 2)
        ("nongnu" . 1)))

;; Keep emacs Custom-settings in separate file
(setq custom-file (expand-file-name "custom.el" user-emacs-directory))
(load custom-file)
#+END_SRC

** Garbage Collections/Collector
#+BEGIN_SRC emacs-lisp
  (use-package gcmh
    :diminish gcmh-mode
    :config
    (setq gcmh-idle-delay 5
          gcmh-high-cons-threshold (* 16 1024 1024))  ; 16mb
    (gcmh-mode 1))

  (add-hook 'emacs-startup-hook
            (lambda ()
              (setq gc-cons-percentage 0.1))) ;; Default value for `gc-cons-percentage'

  (add-hook 'emacs-startup-hook
            (lambda ()
              (message "Emacs ready in %s with %d garbage collections."
                       (format "%.2f seconds"
                               (float-time
                                (time-subtract after-init-time before-init-time)))
                       gcs-done)))
#+END_SRC

** modules
*** Essentials
#+BEGIN_SRC emacs-lisp
(require 'vamp-essentials)
#+END_SRC
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-essentials.el

  ;(setq inhibit-startup-message t)
  ;(setq inhibit-startup-screen t)

  (setq gc-cons-threshold 50000000)
  (setq large-file-warning-threshold 100000000)

  ;; Remove security vulnerability
  (eval-after-load "enriched"
    '(defun enriched-decode-display-prop (start end &optional param)
       (list start end)))

  (require 'cl-lib)
  ;(require 'loadhist)
  ;(file-dependents (feature-file 'cl))

  ;(require 'server)
  ;(if (not (server-running-p)) (server-start))

  (tooltip-mode -1)       ; Disable tooltip
  (blink-cursor-mode -1)  ; Disabale cursor blinking


  (setq visible-bell t)   ; Set the visible bell
  (global-hl-line-mode 1) ; Hilight current line
  ;; Show line number
  (line-number-mode -1)
  ;(global-display-line-numbers-mode 1)
  ;(setq display-line-numbers-type 'normal)
  ;(setq linum-format "%d ")
  ;(setq display-line-numbers-type 'relative)

  ;; Disable line numbers for some modes
  (dolist (mode '(term-mode-hook
                  eshell-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))

  (column-number-mode t)
  (size-indication-mode t)
  (setq truncate-lines 1)  ; Disable line wrapping

  (setq scroll-margin 5
        scroll-conservatively 100000
        scroll-preserve-screen-position 1)


  ;; Only y/n answers
  (setq use-short-answers t)

  (global-auto-revert-mode t)

  (setq-default tab-width 4
                indent-tabs-mode nil)


  ;; Clean white spaces
  (add-hook 'before-save-hook 'whitespace-cleanup)

  ;; Buckups
  (setq backup-directory-alist
        `((".*" . ,temporary-file-directory)))
  (setq auto-save-file-name-transforms
        `((".*" ,temporary-file-directory t)))

  ;; All variables are for Emacs 28+
  (setq package-name-column-width 40)
  (setq package-version-column-width 14)
  (setq package-status-column-width 12)
  (setq package-archive-column-width 8)
  (add-hook 'package-menu-mode-hook #'hl-line-mode)

  ;;======================================================================================================
  ;; KEYS
  ;;======================================================================================================
  ;(recentf-mode 1)
  ; M-x recentf-open-files ; then press the number

  ;; Kill current buffer
  (global-set-key (kbd "C-x k") 'kill-this-buffer)

  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)

  (provide 'vamp-essentials)
#+END_SRC


; Todo: bookmarks
*** Font
#+BEGIN_SRC emacs-lisp
(require 'vamp-font)
#+END_SRC
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-font.el
(set-face-attribute 'default nil :family "JetBrains Mono")
(set-fontset-font t 'symbol "Symbola")

(use-package unicode-fonts
   :ensure t
   :config
    (unicode-fonts-setup))

(use-package ligature
  :ensure t
  :load-path "path-to-ligature-repo"
  :config
  ;; Enable the "www" ligature in every possible major mode
  (ligature-set-ligatures 't '("www"))
  ;; Enable traditional ligature support in eww-mode, if the
  ;; `variable-pitch' face supports it
  (ligature-set-ligatures 'eww-mode '("ff" "fi" "ffi"))
  ;; Enable all Cascadia Code ligatures in programming modes
  (ligature-set-ligatures 'prog-mode
  '("|||>" "<|||" "<==>" "<!--" "####" "~~>" "***" "||=" "||>" ":::" "::=" "=:=" "===" "==>" "=!=" "=>>" "=<<" "=/=" "!==" "!!." ">=>" ">>=" ">>>" ">>-" ">->" "->>" "-->" "---" "-<<" "<~~" "<~>" "<*>" "<||" "<|>" "<$>" "<==" "<=>" "<=<" "<->" "<--" "<-<" "<<=" "<<-" "<<<" "<+>" "</>" "###" "#_(" "..<" "..." "+++" "/==" "///" "_|_" "www" "&&" "^=" "~~" "~@" "~=" "~>" "~-" "**" "*>" "*/" "||" "|}" "|]" "|=" "|>" "|-" "{|" "[|" "]#" "::" ":=" ":>" ":<" "$>" "==" "=>" "!=" "!!" ">:" ">=" ">>" ">-" "-~" "-|" "->" "--" "-<" "<~" "<*" "<|" "<:" "<$" "<=" "<>" "<-" "<<" "<+" "</" "#{" "#[" "#:" "#=" "#!" "##" "#(" "#?" "#_" "%%" ".=" ".-" ".." ".?" "+>" "++" "?:" "?=" "?." "??" ";;" "/*" "/=" "/>" "//" "__" "~~" "(*" "*)" "\\\\" "://"))
  ;; Enables ligature checks globally in all buffers. You can also do
  ;; it per mode with `ligature-mode'.
  (global-ligature-mode t))

(provide 'vamp-font)
#+END_SRC

*** Evil
#+BEGIN_SRC emacs-lisp
(require 'vamp-evil)
#+END_SRC
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-evil.el
  (use-package evil
    :ensure t
    :init
    (setq evil-want-integration t
          evil-want-keybinding nil
          evil-want-C-u-scroll t
          evil-want-C-i-jump nil)
    :config
    (evil-mode 1)
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
    (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)
    ;; Use visual line motions even outside of visual-line-mode buffers
                                          ;(evil-global-set-key 'motion "j" 'evil-next-visual-line)
                                          ;(evil-global-set-key 'motion "k" 'evil-previous-visual-line)
      ;;; Make evil-mode up/down operate in screen lines instead of logical lines
    (define-key evil-motion-state-map "j" 'evil-next-visual-line)
    (define-key evil-motion-state-map "k" 'evil-previous-visual-line)
    ;; Also in visual mode
    (define-key evil-visual-state-map "j" 'evil-next-visual-line)
    (define-key evil-visual-state-map "k" 'evil-previous-visual-line)

    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal))

  (defun rune/evil-hook ()
    (dolist (mode '(eshell-mode
                    git-rebase-mode
                    erc-mod
                    term-mode))
      (add-to-list 'evil-emacs-state-modes mode)))

  (use-package evil-collection
    :ensure t
    :after evil
    :init (evil-collection-init))

  (provide 'vamp-evil)
#+END_SRC

; Todo: evil-redo

*** Modeline
**** =Provide= for init.el
#+BEGIN_SRC emacs-lisp
(require 'vamp-modeline)
#+END_SRC

**** Doom modeline
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-modeline.el
  (use-package doom-modeline
    :ensure t
    :init (doom-modeline-mode 1)
    :custom (setq doom-modeline-hight 10
                  doom-modeline-time 1
                  doom-modeline-time-icon 'nil
                  doom-modeline-buffer-file-name-style 'truncate-nil
                  doom-modeline-checker-simple-format 'nil))
  (display-time-mode 1)
  (display-battery-mode 1)
#+END_SRC

**** Nyan
#+BEGIN_SRC emacs-lisp :tangle no
  (use-package nyan-mode
    :ensure t
    :init (nyan-mode 1))
#+END_SRC

**** Hide modeline
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-modeline.el
  (use-package hide-mode-line
    :ensure t
    :config
    (global-set-key (kbd "C-M-<return>") 'hide-mode-line-mode))

  ;; Diminish lets you hide minor modes from showing in the mode line,
  ;; keeping it minimal.
  (use-package diminish
    :ensure t)
#+END_SRC

**** Parrot
#+BEGIN_SRC emacs-lisp :tangle no
  (use-package parrot
    :config
    (parrot-mode))
#+END_SRC

**** =Provide=
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-modeline.el
  (provide 'vamp-modeline)
#+END_SRC

*** look
rainbow-mode, rainbow-delimiters, theme, centered-window, all-the-icons
**** =Provide= for init.el
#+BEGIN_SRC emacs-lisp
(require 'vamp-look)
#+END_SRC

**** Icons
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-look.el
  ;; NOTE: The first time you load your configuration on a new machine,
  ;; you'll need to run:
  ;; M-x all-the-icons-install-fonts
  (use-package all-the-icons
    :ensure t)
#+END_SRC

**** Custom-set-faces
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-look.el
  (custom-set-faces
   ;; Your init file should contain only one such instance.
   ;; If there is more than one, they won't work right.
   '(fringe ((t (:background "#000000"))))
   '(org-document-title ((t (:inherit (bold modus-themes-variable-pitch) :foreground "#c6eaff" :height 1.6))))
   '(rainbow-delimiters-depth-1-face ((t (:foreground "red"))))
   '(rainbow-delimiters-depth-2-face ((t (:foreground "yellow"))))
   '(rainbow-delimiters-depth-3-face ((t (:foreground "chartreuse")))))
#+END_SRC

**** Rainbow-mode -- spawn colors on colors
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-look.el
  (use-package rainbow-mode
    :ensure t)

  (define-globalized-minor-mode global-rainbow-mode rainbow-mode
    (lambda ()
      (when (not (memq major-mode
                  (list 'org-agenda-mode)))
       (rainbow-mode 1))))
  (global-rainbow-mode 1 )
#+END_SRC

**** Rainbow-delimiters -- colored parentheses
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-look.el
  (use-package rainbow-delimiters
    :ensure t
    :hook (prog-mode . rainbow-delimiters-mode))
#+END_SRC

**** Centered window
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-look.el
  (use-package centered-window
    :ensure t
    :init (centered-window-mode t)
    :config
    ;; Alt-Enter toggle
    (global-set-key (kbd "M-<RET>") 'centered-window-mode))
  ;; Disable centered-window-mode
  (dolist (mode '(term-mode-hook
                  eshell-mode-hook
                  ranger-mode-hook))
    (add-hook mode (lambda () (centered-window-mode 0))))
#+END_SRC

**** modus-themes
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-look.el
  (use-package modus-themes
    :ensure t
    :init
    ;; Add all your customizations prior to loading the themes
    (setq modus-themes-italic-constructs t
          modus-themes-bold-constructs nil
          modus-themes-region '(bg-only no-extend)
          modus-themes-org-blocks 'tinted-background) ; {nil,'gray-background,'tinted-background}
    :config
    (load-theme 'modus-vivendi))
#+END_SRC

**** doom-themes
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-look.el
  (use-package doom-themes
    :ensure t
    :config
    ;; Global settings (defaults)
    (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
          doom-themes-enable-italic t) ; if nil, italics is universally disabled
    ;;(load-theme 'doom-outrun-electric t)  ; OG PURPLE
    ;(load-theme 'doom-moonlight t)        ; OG Purple
    ;; Enable flashing mode-line on errors
    (doom-themes-visual-bell-config)
    ;; Enable custom neotree theme (all-the-icons must be installed!)
    ;(doom-themes-neotree-config)
    ;; or for treemacs users
    ;(setq doom-themes-treemacs-theme "doom-atom") ; use "doom-colors" for less minimal icon theme
    ;(doom-themes-treemacs-config)
    ;; Corrects (and improves) org-mode's native fontification.
    (doom-themes-org-config))
#+END_SRC

**** =Provide=
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-look.el
  (provide 'vamp-look)
#+END_SRC

**** ?Todo: change theme colors
*** Dashboard
**** =Require= for init.el
#+BEGIN_SRC emacs-lisp
(require 'vamp-dashboard)
#+END_SRC

