slatt/init.org
**** Dashboard
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-dashboard.el
(use-package dashboard
  :ensure t
  :config
  (dashboard-setup-startup-hook)
  (setq initial-buffer-choice (lambda () (get-buffer-create "*dashboard*")))
  ;; Set the title
  (setq dashboard-banner-logo-title "Welcome to Emacs")
  ;; Set the banner
  (setq dashboard-startup-banner "/home/vamp/Downloads/playboi_carti/narcissist_new.png"
        ;dashboard-startup-banner 1
        dashboard-center-content t
        dashboard-image-banner-max-height 400
        dashboard-image-banner-max-width 400
        dashboard-set-heading-icons t
        dashboard-set-file-icons t))

;dashboard-choose-banner: Symbol’s function definition is void: image-supported-file-p
#+END_SRC

**** =Provide=
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-dashboard.el
(provide 'vamp-dashboard)
#+END_SRC

*** Completion
**** =Require= for init.el
#+BEGIN_SRC emacs-lisp
(require 'vamp-completion)
#+END_SRC

**** Ivy
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-completion.el
(use-package ivy
  :ensure t
  :diminish
  :bind (("C-s" . swiper)
         :map ivy-minibuffer-map
         ("TAB" . ivy-alt-done)
         ("C-l" . ivy-alt-done)
         ("C-j" . ivy-next-line)
         ("C-k" . ivy-previous-line)
         :map ivy-switch-buffer-map
         ("C-k" . ivy-previous-line)
         ("C-l" . ivy-done)
         ("C-d" . ivy-switch-buffer-kill))
         ;:map ivy-reverse-i-search-kill
         ;("C-k" . ivy-previous-line)
         ;("C-d" . ivy-reverse-i-search-kill))
  :config (ivy-mode 1))

;(use-package ivy-rich
;    :init
;    (ivy-rich-mode 1))
(require 'ivy-rich)
(ivy-rich-mode 1)
#+END_SRC

**** Counsel
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-completion.el
(use-package counsel
  :ensure t
  :bind ("C-M-j" . 'counsel-switch-buffer)
         ;:map minibuffer-local-map
         ;("C-r" . 'counsel-minibuffer-history))
  :custom
  (counsel-linux-app-format-function #'counsel-linux-app-format-function-name-only)
  :config
  (counsel-mode 1))
#+END_SRC

**** Company
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-completion.el
  (use-package company
    :ensure t
    :diminish company-mode
    :config
    (setq company-idle-delay 0
          company-minimum-prefix-length 3
          company-selection-wrap-around t)
    (add-hook 'after-init-hook #'global-company-mode))
#+END_SRC

**** Syntax checking
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-completion.el
;; Syntax checking
(use-package flycheck
  :ensure t
  :diminish flycheck-mode)
  ;:config
  ;(add-hook 'after-init-hook #'global-flycheck-mode))

;; Spell checking
(use-package flycheck-aspell
  :ensure t)
;; Ensure `flycheck-aspell' is available
(require 'flycheck-aspell)
;; If you want to check TeX/LaTeX/ConTeXt buffers
(add-to-list 'flycheck-checkers 'tex-aspell-dynamic)
;; If you want to check Markdown/GFM buffers
(add-to-list 'flycheck-checkers 'markdown-aspell-dynamic)
;; If you want to check HTML buffers
(add-to-list 'flycheck-checkers 'html-aspell-dynamic)
;; If you want to check XML/SGML buffers
(add-to-list 'flycheck-checkers 'xml-aspell-dynamic)
;; If you want to check Nroff/Troff/Groff buffers
(add-to-list 'flycheck-checkers 'nroff-aspell-dynamic)
;; If you want to check Texinfo buffers
(add-to-list 'flycheck-checkers 'texinfo-aspell-dynamic)
;; If you want to check comments and strings for C-like languages
(add-to-list 'flycheck-checkers 'c-aspell-dynamic)
;; If you want to check message buffers
(add-to-list 'flycheck-checkers 'mail-aspell-dynamic)
;; Because Aspell does not support Org syntax, the user has
;; to define a checker with the desired flags themselves.
(flycheck-aspell-define-checker "org"
  "Org" ("--add-filter" "url")
  (org-mode))
(add-to-list 'flycheck-checkers 'org-aspell-dynamic)

(setq ispell-dictionary "polish")
(setq ispell-program-name "aspell")
(setq ispell-silently-savep t)

;You may also want to advice ispell-pdict-save to refresh flycheck when
;inserting new entries into your local dictionary. This way highlighting
;instantly updates when you add a previously unknown word.
(advice-add #'ispell-pdict-save :after #'flycheck-maybe-recheck)
(defun flycheck-maybe-recheck (_)
  (when (bound-and-true-p flycheck-mode)
   (flycheck-buffer)))

; Cycle through different languages
(let ((langs '("english" "polish")))
  (setq lang-ring (make-ring (length langs)))
  (dolist (elem langs) (ring-insert lang-ring elem)))

(defun cycle-ispell-languages ()
  (interactive)
  (let ((lang (ring-ref lang-ring -1)))
    (ring-insert lang-ring lang)
    (ispell-change-dictionary lang)))

(global-set-key [f6] 'cycle-ispell-languages)
#+END_SRC

**** which-key
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-completion.el
    (use-package which-key
      :ensure t
      :init (which-key-mode)
      :diminish which-key-mode
      :config
      (setq which-key-idle-delay 0.3
            which-key-idle-secondary-delay 0.3)
      (which-key-setup-side-window-bottom))
#+END_SRC

**** =Provide=
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-completion.el
(provide 'vamp-completion)
#+END_SRC

; Todo: Prots dired easy fiding
*** Org
**** =Require= for init.el
#+BEGIN_SRC emacs-lisp
(require 'vamp-org)
#+END_SRC

**** org
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-org.el
  (local-set-key (kbd "M-j") 'org-metadown)
  (local-set-key (kbd "M-k") 'org-metaup)

  (setq org-directory "~/death_note")
  (setq org-agenda-files "~/death_note/agenda.org")
  (use-package org-download
    :ensure t
    :custom
    (org-download-method 'directory)
    (org-download-image-dir "~/death_note/.img")
    (org-download-heading-lvl 0)
    (org-download-timestamp "org_%Y%m%d-%H%M%S_")
    (org-image-actual-width 900)
    (org-download-screenshot-method "xclip -selection clipboard -t image/png -o > '%s'")
    :config
    (require 'org-download)
    ;; Drag-and-drop to `dired`
    (add-hook 'dired-mode-hook 'org-download-enable))

  ;; dispaly images (keybind "zi" toggle)
  (setq org-startup-with-inline-images t)

  (use-package org-auto-tangle
    :ensure t
    :init (setq org-auto-tangle-default t)
    :hook (org-mode . org-auto-tangle-mode))

  ;; Org hide codeblock info
  ;(let ((background-color (face-attribute 'default :background)))
  ;  (set-face-attribute 'org-block-begin-line nil
  ;                      :foreground background-color
  ;                      :background background-color))
  ;; Org codeblock info color
  (let ((background-color (face-attribute 'default :background)))
    (set-face-attribute 'org-block-begin-line nil
                        :background "#551a8b"))
                        ;:background "#8b008b"))

#+END_SRC

***** Headlines
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-org.el
 ;; Org headings
 (use-package org-bullets
   :ensure t
   :after org
   :hook (org-mode . org-bullets-mode)
   :custom
   (org-bullets-bullet-list '("●" "○" "●" "○" "●" "○" "●")))

 ;; Org headline
 ;https://zzamboni.org/post/beautifying-org-mode-in-emacs/
 (set-face-attribute 'org-link nil
                     :background nil)
 (set-face-attribute 'org-code nil
                     ;:foreground "#a9a1e1"
                     :background nil)
 (set-face-attribute 'org-date nil
                     :background nil)
 (set-face-attribute 'org-level-1 nil
                     :foreground "#8a2be2"
                     :background nil
                     :height 1.8
                     :weight 'normal)
 (set-face-attribute 'org-level-2 nil
                     :foreground "#ee7ae7"
                     :background nil
                     :height 1.5)
 (set-face-attribute 'org-level-3 nil
                     :foreground "#bf3eff"
                     :background nil
                     :height 1.3)
 (set-face-attribute 'org-level-4 nil
                     :foreground "#cd6090"
                     :background nil
                     :height 1.1)
#+END_SRC

