slatt/vamp-modules/vamp-org.el
;; Org
(setq org-directory "~/death_note")
(setq org-agenda-files "~/death_note/agenda.org")
(use-package org-download
  :ensure t
  :config
  (setq-default org-download-image-dir "~/death_note/.img"))

;; dispaly images (keybind "zi" toggle)
(setq org-startup-with-inline-images t)

(use-package org-auto-tangle
  :ensure t
  :init (setq org-auto-tangle-default t)
  :hook (org-mode . org-auto-tangle-mode))

;; Org hide codeblock info
;(let ((background-color (face-attribute 'default :background)))
;  (set-face-attribute 'org-block-begin-line nil
;                      :foreground background-color
;                      :background background-color))

;; Org headings
(use-package org-bullets
  :ensure t
  :after org
  :hook (org-mode . org-bullets-mode)
  :custom
  (org-bullets-bullet-list '("●" "○" "●" "○" "●" "○" "●")))

;; Org headline
(set-face-attribute 'org-link nil
                    :weight 'normal
                    :background nil)
(set-face-attribute 'org-code nil
                    ;;:foreground "#a9a1e1"
                    :background nil)
(set-face-attribute 'org-date nil
                    :background nil)
(set-face-attribute 'org-level-1 nil
                    :background nil
                    :height 1.5
                    :weight 'normal)
(set-face-attribute 'org-level-2 nil
                    :background nil
                    :height 1.2
                    :weight 'normal)
(set-face-attribute 'org-level-3 nil
                    :background nil
                    :height 1.0
                    :weight 'normal)
;; Move headlines using ALT j/k
(add-hook 'org-mode-hook
          (lambda () (local-set-key (kbd "M-k") #'org-metaup)
                     (local-set-key (kbd "M-j") #'org-metadown)))
