slatt/init.org
***** Org-todo
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-org.el
  ;; Types of tasks and customization
  (setq org-todo-keywords '((sequence "TODO(t)" "IN-PROGRESS(i)" "WAITING(w)" "|" "DONE(d)" " CANCELLED(c)"))
        org-todo-keyword-faces
        '(("TODO" :foreground "#ff0000" :weight normal :underline t)
          ("WAITING" :foreground "#9f7efe" :weight normal :underline t)
          ("IN-PROGRESS" :foreground "#551a8b" :weight normal :underline t)
          ("DONE" :foreground "#50a14f" :weight normal :underline t)
          ("CANCELLED" :foreground "#666666" :weight normal :underline t)))
  ;  (setq org-todo-keywords
  ;        '((sequence "TODO(t)" "WAITING(w)" "IN-PROGRESS(i)"  "|" "DONE(d)" "CANCELLED(c)")))
  ;  (setq org-todo-keyword-faces
  ;        '(("TODO" . "#ff0000") ("WAITING" . "#9f7efe") ("IN-PROGRESS" . "#551a8b") ("CANCELLED" . "#50a14f") ("DONE" . "#666666"))))
  ;; Priority colors
  (setq org-priority-faces
        '((?A :foreground "#ff0000")
          (66 :foreground "#ffa500")
          (67 :foreground "#0098dd")
          (68 :foreground "green")))
  ;; Priority look
  (use-package org-fancy-priorities
    :ensure t
    :hook (org-mode . org-fancy-priorities-mode)
    :config
    (setq org-fancy-priorities-list '("HIGH" "MID" "LOW" "OPTIONAL")))

  ;;======================================================================================================
  ;; Org-agenda
  ;http://www.cachestocaches.com/2016/9/my-workflow-org-agenda/

#+END_SRC

***** Org-capture
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-org.el
  ;; Org-capture
  ;; Define the custum capture templates
  (setq org-capture-templates
         '(("t" "todo" entry (file org-default-notes-file)
            "* TODO %?\n%u\n%a\n" :clock-in t :clock-resume t)
           ("m" "Meeting" entry (file org-default-notes-file)
            "* MEETING with %? :MEETING:\n%t" :clock-in t :clock-resume t)
           ("d" "Diary" entry (file+datetree "~/death_note/diary.org")
            "* %?\n%U\n" :clock-in t :clock-resume t)
           ("i" "Idea" entry (file org-default-notes-file)
            "* %? :IDEA: \n%t" :clock-in t :clock-resume t)
           ("n" "Next Task" entry (file+headline org-default-notes-file "Tasks")
            "** NEXT %? \nDEADLINE: %t")))
  (local-set-key (kbd "C-c c") 'org-capture)

  ;; Set default column view headings: Task Total-Time Time-Stamp
  (setq org-columns-default-format "%50ITEM(Task) %10CLOCKSUM %16TIMESTAMP_IA")
  ;Once you've included this, activate org-columns with C-c C-x C-c while on a top-level heading,
  ;which will allow you to view the time you've spent at the different levels

#+END_SRC

***** Keys
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-org.el
  ;; Move headlines using ALT j/k
  (add-hook 'org-mode-hook
            (lambda () (local-set-key (kbd "M-k") #'org-metaup)
                       (local-set-key (kbd "M-j") #'org-metadown)))
#+END_SRC

***** =Provide=
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-org.el
(provide 'vamp-org)
#+END_SRC

***** Todo: org-agenda customization,
*** File browsers
**** =Require= for init.el
#+BEGIN_SRC emacs-lisp
(require 'vamp-filebrowser)
#+END_SRC

**** Find-file
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-filebrowser.el


#+END_SRC

**** Treemacs
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-filebrowser.el
(use-package treemacs
  :ensure t
  :config
  (setq treemacs-is-never-other-window t)
  (global-set-key (kbd "<f5>") 'treemacs)
  (global-set-key (kbd "C-<f5>") 'treemacs-select-window))
#+END_SRC

**** Ranger
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-filebrowser.el
(use-package ranger
  :ensure t
  :config
  (global-set-key (kbd "C-<return>") 'ranger)
  (setq ranger-show-hidden t))
#+END_SRC

**** =Provide=
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-filebrowser.el
(provide 'vamp-filebrowser)
#+END_SRC

*** Terminal
**** =require= for init.el
#+BEGIN_SRC emacs-lisp
(require 'vamp-terminal)
#+END_SRC

**** Vterm
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-terminal.el
  (use-package vterm
    :commands vterm
    :config
    (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *")
    (setq vterm-shell "zsh")
    (setq vterm-max-scrollback 10000))
#+END_SRC

**** Eshell
***** eshell config
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-terminal.el
  (defun vamp-configure-eshell ()
    ;; Save command history when commands are entered
    (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)

    ;; Truncate buffer for performance
    (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

    ;; Bindings for evil-mode
    (evil-define-key '(normal insert visual) eshell-mode-map (kbd "C-r") 'counsel-esh-history)
    (evil-define-key '(normal insert visual) eshell-mode-map (kbd "<home>") 'eshell-bol)
    (evil-normalize-keymaps)

    (setq eshell-history-size 10000
          eshell-buffer-maximum-lines 10000
          eshell-hist-ignoredups t
          eshell-scroll-to-bottom-on-input t))

#+END_SRC

***** Eshell
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-terminal.el
  (use-package eshell-git-prompt)

  (use-package eshell
    :hook (eshell-first-time-mode . vamp-configure-eshell)
    :config
    (with-eval-after-load 'esh-opt
      (setq eshell-destroy-buffer-when-proces-dies t)
      (setq eshell-visual-commans '("htop" "zsh" "vim")))
    (eshell-git-prompt-use-theme 'multiline2))
#+END_SRC

**** =provide=
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-terminal.el
(provide 'vamp-terminal)
#+END_SRC

*** Large files
**** =require= for init.el
#+BEGIN_SRC emacs-lisp
(require 'vamp-large_files)
#+END_SRC

**** Vlf
https://github.com/m00natic/vlfi
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-large_files.el
   (use-package vlf
     :ensure t)
   (custom-set-variables
    '(vlf-application 'dont-ask))

#+END_SRC

**** =provide=
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-large_files.el
(provide 'vamp-large_files)
#+END_SRC

*** GIT
**** =require= for init.el
#+BEGIN_SRC emacs-lisp
(require 'vamp-git)
#+END_SRC

**** Magit
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-git.el
  (use-package magit
    :ensure t)
#+END_SRC

**** Git-gutter - changes indicator
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-git.el
  (use-package git-gutter
    :ensure t
    :init (global-git-gutter-mode +1))
#+END_SRC

**** Git-timemachine
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-git.el
  (use-package git-timemachine
    :ensure t)
#+END_SRC

**** =provide=
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-git.el
(provide 'vamp-git)
#+END_SRC

*** Hydra
**** =require= for init.el
#+BEGIN_SRC emacs-lisp
(require 'vamp-hydra)
#+END_SRC

**** hydra
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-hydra.el
  (use-package hydra
    :defer t)

#+END_SRC

**** Hydra-winodws
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-hydra.el
  (defun vamp/split-window-vertically-and-switch ()
    (interactive)
    (split-window-vertically)
    (other-window 1))
  (defun vamp/split-window-horizontally-and-switch ()
    (interactive)
    (split-window-horizontally)
    (other-window 1))
  ;; from https://gist.github.com/3402786
  (defun vamp/toggle-maximize-buffer ()
    "Maximize buffer"
    (interactive)
    (if (and (= 1 (length (window-list)))
             (assoc ?_ register-alist))
        (jump-to-register ?_)
      (progn
        (window-configuration-to-register ?_)
        (delete-other-windows))))


    ;; All-in-one window managment. Makes use of some custom functions,
    ;; `ace-window' (for swapping), `windmove' (could probably be replaced
    ;; by evil?) and `windresize'.
    ;; inspired by https://github.com/jmercouris/configuration/blob/master/.emacs.d/hydra.el#L86
    (defhydra vamp-hydra-window (:hint nil)
     "
    Movement      ^Split^            ^Switch^        ^Resize^
    ----------------------------------------------------------------
    _M-h_ <     _/_ vertical         _b_uffer       _h_  <
    _M-j_ >     _-_ horizontal       _f_ind file    _j_ ↓
    _M-k_ ↑      _m_aximize          _s_wap         _k_ ↑
    _M-l_ ↓      _c_lose            _[_ backward    _l_ >
     _q_uit      _e_qualize         _]_ forward     ^
    ^               ^                _K_ill         ^
    ^               ^                  ^             ^
    "
       ;; Movement
       ("M-h" windmove-left)
       ("M-j" windmove-down)
       ("M-k" windmove-up)
       ("M-l" windmove-right)

       ;; Split/manage
       ("-" vamp/split-window-vertically-and-switch)
       ("/" vamp/split-window-horizontally-and-switch)
       ("c" evil-window-delete)
       ("d" evil-window-delete)
       ("m" delete-other-windows)
       ("e" balance-windows)

       ;; Switch
       ("b" counsel-switch-buffer)
       ("f" counsel-find-file)
       ("P" project-find-file)
       ("s" ace-swap-window)
       ("[" previous-buffer)
       ("]" next-buffer)
       ("K" kill-this-buffer)

       ;; Resize
       ("h" shrink-window-horizontally)
       ("j" shrink-window)
       ("k" enlarge-window)
       ("l" enlarge-window-horizontally)

       ("q" nil))

#+END_SRC

**** =provide=
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-hydra.el
(provide 'vamp-hydra)
#+END_SRC

*** Keys
**** =require= for init.el
#+BEGIN_SRC emacs-lisp
(require 'vamp-keys)
#+END_SRC

**** General
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-keys.el
  (add-to-list 'load-path "~/.config/emacs/packages/general")
  (require 'general)

  (general-def
    :states '(normal visual motion)
    :keymaps 'override)
#+END_SRC

**** SPC Leader Key
***** SPC =start=
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-keys.el
  (general-define-key
   :states '(normal motion visual)
   :keymaps 'override
   :prefix "SPC"

#+END_SRC

***** Buffers
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-keys.el
  "b b"   '(ibuffer :which-key "Ibuffer")
  "b c"   '(clone-indirect-buffer-other-window :which-key "Clone indirect buffer other window")
  "b k"   '(kill-current-buffer :which-key "Kill current buffer")
  "b n"   '(next-buffer :which-key "Next buffer")
  "b p"   '(previous-buffer :which-key "Previous buffer")
  "b B"   '(ibuffer-list-buffers :which-key "Ibuffer list buffers")
  "b K"   '(kill-buffer :which-key "Kill buffer")

#+END_SRC

***** Hydra
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-keys.el
   "a" '(nil :which-key "hydras")
   "aw" '(vamp-hydra-window/body :which-key "window control")

#+END_SRC

***** Help
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-keys.el
  "h" '(nil :which-key "help/emacs")

  "hv" '(counsel-describe-variable :which-key "des. variable")
  "hb" '(counsel-descbinds :which-key "des. bindings")
  "hM" '(describe-mode :which-key "des. mode")
  "hf" '(counsel-describe-function :which-key "des. func")
  "hF" '(counsel-describe-face :which-key "des. face")
  "hk" '(describe-key :which-key "des. key")

  "hed" '((lambda () (interactive) (jump-to-register 67)) :which-key "edit dotfile")

  "hm" '(nil :which-key "switch mode")
  "hme" '(emacs-lisp-mode :which-key "elisp mode")
  "hmo" '(org-mode :which-key "org mode")
  "hmt" '(text-mode :which-key "text mode")

  "hp" '(nil :which-key "packages")
  "hpr" '(package-refresh-contents :which-key "regresh packages database")
  "hpi" '(package-install :which-key "install package")
  "hpd" '(package-delete :which-key "delete package")
#+END_SRC

***** Window
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-keys.el
   "w" '(nil :which-key "window")
   "wm" '(vamp/toggle-maximize-buffer :which-key "maximize buffer")
   "wN" '(make-frame :which-key "make frame")
   "wd" '(evil-window-delete :which-key "delete window")
   "w-" '(vamp/split-window-vertically-and-switch :which-key "split below")
   "w/" '(vamp/split-window-horizontally-and-switch :which-key "split right")
   "wr" '(vamp-hydra-window/body :which-key "hydra window")
   "wl" '(evil-window-right :which-key "evil-window-right")
   "wh" '(evil-window-left :which-key "evil-window-left")
   "wj" '(evil-window-down :which-key "evil-window-down")
   "wk" '(evil-window-up :which-key "evil-window-up")
   "wz" '(text-scale-adjust :which-key "text zoom")

#+END_SRC

***** Org
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-keys.el
  "o"   '(nil :which-key "Org")
  "oii" '(org-download-clipboard :which-key "img form clipboard")
#+END_SRC

***** Toggle
#+BEGIN_SRC emacs-lisp :tangle ./vamp-modules/vamp-keys.el
  "t" '(nil :which-key "toggles")
  "tt" '(toggle-truncate-lines :which-key "truncate lines")
  "tv" '(visual-line-mode :which-key "visual line mode")
  "tn" '(display-line-numbers-mode :which-key "display line numbers")
  "ta" '(mixed-pitch-mode :which-key "variable pitch mode")
  "tc" '(visual-fill-column-mode :which-key "visual fill column mode")
  "ty" '(counsel-load-theme :which-key "load theme")
  "tw" '(centered-window-mode :which-key "writeroom-mode")
  "tR" '(read-only-mode :which-key "read only mode")
  "tI" '(toggle-input-method :which-key "toggle input method")
  "tr" '(display-fill-column-indicator-mode :which-key "fill column indicator")
  "tm" '(hide-mode-line-mode :which-key "hide modeline mode")
  "te" '(org-hide-emphasis-markers :which-key "hide emphasis markup")

#+END_SRC

